src/CFD/heatedplate1/fluid-openfoam/0/T
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 300;

boundaryField
{
    interface
    {
        type            fixedGradient;
        gradient        uniform 0;
    }
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    bottom
    {
        type            externalWallHeatFluxTemperature;
        mode            flux;
        q               uniform 400.0;
        kappaMethod     fluidThermo;
        value           $internalField;
    }
    slip-bottom
    {
        type            zeroGradient;
    }
    outerWall
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}
